###################################################################

# Created by write_sdc on Fri May 31 03:25:51 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_max_transition 1 [current_design]
create_clock [get_ports clock_uncore]  -period 1  -waveform {0 0.5}
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_aw_ready]
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_w_ready]
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_b_valid]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_id[3]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_id[2]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_id[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_id[0]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_resp[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_b_bits_resp[0]}]
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_ar_ready]
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_r_valid]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_id[3]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_id[2]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_id[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_id[0]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[63]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[62]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[61]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[60]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[59]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[58]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[57]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[56]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[55]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[54]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[53]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[52]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[51]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[50]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[49]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[48]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[47]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[46]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[45]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[44]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[43]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[42]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[41]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[40]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[39]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[38]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[37]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[36]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[35]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[34]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[33]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[32]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[31]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[30]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[29]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[28]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[27]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[26]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[25]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[24]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[23]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[22]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[21]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[20]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[19]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[18]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[17]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[16]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[15]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[14]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[13]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[12]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[11]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[10]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[9]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[8]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[7]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[6]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[5]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[4]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[3]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[2]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_data[0]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_resp[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_r_bits_resp[0]}]
set_input_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_r_bits_last]
set_input_delay -clock clock_uncore  0  [get_ports custom_boot]
set_input_delay -clock clock_uncore  0  [get_ports jtag_TCK]
set_input_delay -clock clock_uncore  0  [get_ports jtag_TMS]
set_input_delay -clock clock_uncore  0  [get_ports jtag_TDI]
set_input_delay -clock clock_uncore  0  [get_ports reset_io]
set_input_delay -clock clock_uncore  0  [get_ports clock_tileClockGroup_rockettile_0]
set_input_delay -clock clock_uncore  0  [get_ports clock_tileClockGroup_rockettile_1]
set_input_delay -clock clock_uncore  0  [get_ports serial_tl_0_in_valid]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[31]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[30]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[29]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[28]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[27]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[26]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[25]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[24]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[23]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[22]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[21]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[20]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[19]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[18]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[17]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[16]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[15]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[14]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[13]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[12]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[11]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[10]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[9]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[8]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[7]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[6]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[5]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[4]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[3]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[2]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[1]}]
set_input_delay -clock clock_uncore  0  [get_ports {serial_tl_0_in_bits[0]}]
set_input_delay -clock clock_uncore  0  [get_ports serial_tl_0_out_ready]
set_input_delay -clock clock_uncore  0  [get_ports serial_tl_0_clock_in]
set_input_delay -clock clock_uncore  0  [get_ports uart_0_rxd]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_clock]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_aw_valid]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_id[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_id[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_id[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_id[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[31]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[30]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[29]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[28]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[27]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[26]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[25]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[24]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[23]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[22]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[21]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[20]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[19]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[18]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[17]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[16]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[15]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[14]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[13]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[12]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[11]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[10]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[9]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[8]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_addr[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_len[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_size[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_size[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_size[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_burst[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_burst[0]}]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_aw_bits_lock]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_cache[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_cache[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_cache[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_cache[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_prot[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_prot[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_prot[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_qos[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_qos[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_qos[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_aw_bits_qos[0]}]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_w_valid]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[63]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[62]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[61]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[60]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[59]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[58]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[57]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[56]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[55]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[54]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[53]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[52]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[51]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[50]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[49]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[48]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[47]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[46]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[45]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[44]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[43]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[42]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[41]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[40]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[39]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[38]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[37]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[36]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[35]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[34]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[33]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[32]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[31]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[30]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[29]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[28]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[27]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[26]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[25]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[24]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[23]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[22]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[21]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[20]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[19]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[18]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[17]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[16]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[15]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[14]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[13]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[12]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[11]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[10]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[9]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[8]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_data[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_w_bits_strb[0]}]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_w_bits_last]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_b_ready]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_ar_valid]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_id[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_id[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_id[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_id[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[31]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[30]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[29]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[28]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[27]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[26]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[25]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[24]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[23]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[22]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[21]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[20]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[19]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[18]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[17]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[16]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[15]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[14]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[13]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[12]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[11]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[10]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[9]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[8]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_addr[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_len[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_size[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_size[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_size[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_burst[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_burst[0]}]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_ar_bits_lock]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_cache[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_cache[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_cache[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_cache[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_prot[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_prot[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_prot[0]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_qos[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_qos[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_qos[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {axi4_mem_0_bits_ar_bits_qos[0]}]
set_output_delay -clock clock_uncore  0  [get_ports axi4_mem_0_bits_r_ready]
set_output_delay -clock clock_uncore  0  [get_ports jtag_TDO]
set_output_delay -clock clock_uncore  0  [get_ports clock_tap]
set_output_delay -clock clock_uncore  0  [get_ports serial_tl_0_in_ready]
set_output_delay -clock clock_uncore  0  [get_ports serial_tl_0_out_valid]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[31]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[30]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[29]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[28]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[27]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[26]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[25]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[24]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[23]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[22]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[21]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[20]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[19]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[18]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[17]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[16]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[15]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[14]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[13]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[12]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[11]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[10]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[9]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[8]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[7]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[6]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[5]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[4]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[3]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[2]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[1]}]
set_output_delay -clock clock_uncore  0  [get_ports {serial_tl_0_out_bits[0]}]
set_output_delay -clock clock_uncore  0  [get_ports uart_0_txd]
